
<!DOCTYPE html>
<html>
  <head>
    <title>CPPNotes</title>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <style>

    bat<span class="token punctuation">.</span>age <span class="token operator">=</span> <span class="token number">5</span><span class="token punctuation">;</span> <span class="token comment">// 通过派生类访问基类成员age</span>

    std<span class="token double-colon punctuation">::</span>cout <span class="token operator">&lt;&lt;</span> <span class="token string">"Bat's age: "</span> <span class="token operator">&lt;&lt;</span> bat<span class="token punctuation">.</span>age <span class="token operator">&lt;&lt;</span> std<span class="token double-colon punctuation">::</span>endl<span class="token punctuation">;</span>
    bat<span class="token punctuation">.</span><span class="token function">eat</span><span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span> <span class="token comment">// 通过派生类访问虚基类Mammal的成员函数eat</span>
    bat<span class="token punctuation">.</span><span class="token function">fly</span><span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span> <span class="token comment">// 通过派生类访问虚基类Bird的成员函数fly</span>
    bat<span class="token punctuation">.</span><span class="token function">sleep</span><span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span> <span class="token comment">// 通过派生类访问自身的成员函数sleep</span>

    <span class="token keyword keyword-return">return</span> <span class="token number">0</span><span class="token punctuation">;</span>
<span class="token punctuation">}</span>
</code></pre><h2 id="虚继承-font-size3back类和对象-font-size3backcppnotesfontfont" ebook-toc-level-2="" heading="虚继承 <font size=&quot;3&quot;><a href=&quot;#%E7%B1%BB%E5%92%8C%E5%AF%B9%E8%B1%A1-font-size3backcppnotesfont&quot;>back</a></font> ">虚继承 <font size="3"><a href="#%E7%B1%BB%E5%92%8C%E5%AF%B9%E8%B1%A1-font-size3backcppnotesfont">back</a></font> </h2>
<ul>
<li>
<p><strong>定义</strong><br>
为了解决多继承时的命名冲突和冗余数据问题，C++ 提出了虚继承，使得在派生类中只保留一份间接基类的成员。<br>
当存在多个派生类共享相同的基类时，为了避免派生类中出现多个相同的虚基类子对象，可以使用虚继承。<br>
通过在派生类之间使用<code>virtual</code>关键字继承共同的基类，可以确保只有一个虚基类子对象。</p>
</li>
<li>
<p><strong>虚基类成员的可见性</strong><br>
<em>（A为基类，B、C为虚继承A的中间类，D为继承B和C的派生类）</em><br>
假设 A 定义了一个名为<code>x</code>的成员变量，当我们在 D 中直接访问<code>x</code>时，会有三种可能性：</p>
<ul>
<li>如果 B 和 C 中都没有<code>x</code>的定义，那么<code>x</code>将被解析为 A 的成员，此时不存在二义性。</li>
<li>如果 B 或 C 其中的一个类定义了<code>x</code>，也不会有二义性，派生类的<code>x</code>比虚基类的<code>x</code>优先级更高。</li>
<li>如果 B 和 C 中都定义了<code>x</code>，那么直接访问<code>x</code>将产生二义性问题。</li>
</ul>
</li>
<li>
<p><strong>虚继承的编译器实现</strong><br>
在编译器内部，每个含有虚基类的派生类都会被分配一个虚基类指针（vptr）。这个指针指向一个虚基类表（vtable），其中存储了虚基类的偏移量信息。</p>
<p>虚基类指针的作用是在派生类对象中存储虚基类的地址偏移量，使得派生类可以通过虚基类指针访问到虚基类的成员。</p>
<p>虚基类表是一个用于存储虚基类的地址偏移量的数组，与派生类对象对应。虚基类表的大小与派生类的层次结构有关，每个派生类都有一个对应的虚基类表。</p>
<p>在派生类的构造函数中，会通过调用虚基类的构造函数来初始化虚基类的成员。在派生类对象的内存布局中，虚基类子对象位于最后。</p>
<p>当派生类对象被创建时，编译器会负责初始化虚基类指针，并将其指向正确的虚基类子对象。通过虚基类指针和虚基类表，派生类可以正确地访问虚基类的成员。</p>
</li>
<li>
<p><strong>虚继承的内存结构</strong><br>
在菱形继承的示例中，我们创建了一个Bat对象。在MSVC编译器中，Bat对象的内存布局如下：</p>
<pre data-role="codeBlock" data-info="" class="language-text text"><code>class Bat size(12):
       +---
0      | +--- (base class Mammal)
0      | | {vbptr}
       | +---
4      | +--- (base class Bird)
4      | | {vbptr}
       | +---
       +---
       +--- (virtual base Animal)
8      | age
       +---

Bat::$vbtable@Mammal@:
0   | 0
1   | 8 (Batd(Mammal+0)Animal)

Bat::$vbtable@Bird@:
0   | 0
1   | 4 (Batd(Mammal+0)Animal)

vbi:    class    offset   o.vbptr  o.vbte  fVtorDisp
        Animal        8         0       4  0
</code></pre><ol>
<li>
<p>类名和大小：该类名为Bat，大小为12个字节。</p>
</li>
<li>
<p>基类Mammal：从偏移量0开始，占据4个字节。该基类具有一个虚基类指针（vbptr）。</p>
</li>
<li>
<p>基类Bird：从偏移量4开始，占据4个字节。该基类也具有一个虚基类指针（vbptr）。</p>
</li>
<li>
<p>虚基类Animal：从偏移量8开始，占据4个字节。虚基类子对象Animal的成员变量age占据其中的4个字节。</p>
</li>
<li>
<p>Bat::$vbtable@Mammal@：这是Mammal类的虚基类表。第一项为偏移量0，第二项为8。这表示Bat类中的Mammal子对象的偏移量为0，相对于Mammal类的虚基类Animal的偏移量为8。</p>
</li>
<li>
<p>Bat::$vbtable@Bird@：这是Bird类的虚基类表。第一项为偏移量0，第二项为4。这表示Bat类中的Bird子对象的偏移量为0，相对于Bird类的虚基类Animal的偏移量为4。</p>
</li>
<li>
<p>vbi（虚基类信息）：这部分描述了Bat类中的虚基类Animal的信息。class为虚基类名称Animal，offset为在Bat类中的偏移量8，o.vbptr为虚基类指针的偏移量0，o.vbte为虚基类指针的大小4，fVtorDisp为虚基类指针的偏移量修正值为0。</p>
</li>
</ol>
<p><em><strong>由上，虚继承会改变对象的空间占用</strong></em><br>
在使用虚继承时，每个派生类对象会增加一个额外的虚基类指针（vptr），用于存储虚基类的地址偏移量。这个额外的指针会占用一定的内存空间。</p>
<p>此外，每个派生类都会有一个对应的虚基类表（vtable），用于存储虚基类的地址偏移量信息。虚基类表的大小与派生类的层次结构有关，每个派生类都有一个对应的虚基类表。虚基类表的存在也会占用一定的内存空间。</p>
</li>
</ul>
<h2 id="多态的分类-font-size3back类和对象-font-size3backcppnotesfontfont" ebook-toc-level-2="" heading="多态的分类 <font size=&quot;3&quot;><a href=&quot;#%E7%B1%BB%E5%92%8C%E5%AF%B9%E8%B1%A1-font-size3backcppnotesfont&quot;>back</a></font> ">多态的分类 <font size="3"><a href="#%E7%B1%BB%E5%92%8C%E5%AF%B9%E8%B1%A1-font-size3backcppnotesfont">back</a></font> </h2>
<ul>
<li>静态多态（函数重载和运算符重载）<br>
<em>函数地址早绑定，编译阶段确定函数地址</em></li>
<li>动态多态（派生类和虚函数）<br>
<em>函数地址晚绑定，运行阶段确定函数地址</em></li>
</ul>
<p><em>Simple Example (Overwrite speak method)</em></p>
<pre data-role="codeBlock" data-info="c++" class="language-cpp c++"><code><span class="token keyword keyword-class">class</span> <span class="token class-name">Animal</span><span class="token punctuation">{</span>
<span class="token keyword keyword-public">public</span><span class="token operator">:</span>
    <span class="token comment">// 重写须 返回值类型，函数名，参数列表完全一致</span>
    <span class="token keyword keyword-virtual">virtual</span> <span class="token keyword keyword-void">void</span> <span class="token function">speak</span><span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">{</span>
        cout <span class="token operator">&lt;&lt;</span> <span class="token string">"Animal Speak"</span> <span class="token operator">&lt;&lt;</span> endl<span class="token punctuation">;</span>
    <span class="token punctuation">}</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token comment">// 动态多态满足条件</span>
<span class="token comment">// 1. 子类继承父类</span>
<span class="token comment">// 2. 重写父类的虚函数</span>
<span class="token keyword keyword-class">class</span> <span class="token class-name">Cat</span><span class="token operator">:</span> <span class="token base-clause"><span class="token keyword keyword-public">public</span> <span class="token class-name">Animal</span></span><span class="token punctuation">{</span>
    <span class="token keyword keyword-virtual">virtual</span> <span class="token keyword keyword-void">void</span> <span class="token function">speak</span><span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">{</span>
        cout <span class="token operator">&lt;&lt;</span> <span class="token string">"Cat Meow~"</span> <span class="token operator">&lt;&lt;</span> endl<span class="token punctuation">;</span>
    <span class="token punctuation">}</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword keyword-class">class</span> <span class="token class-name">Dog</span><span class="token operator">:</span> <span class="token base-clause"><span class="token keyword keyword-public">public</span> <span class="token class-name">Animal</span></span><span class="token punctuation">{</span>
    <span class="token keyword keyword-virtual">virtual</span> <span class="token keyword keyword-void">void</span> <span class="token function">speak</span><span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">{</span>
        cout <span class="token operator">&lt;&lt;</span> <span class="token string">"Dog Bark!"</span> <span class="token operator">&lt;&lt;</span> endl<span class="token punctuation">;</span>
    <span class="token punctuation">}</span>
<span class="token punctuation">}</span><span class="token punctuation">;</span>
<span class="token keyword keyword-void">void</span> <span class="token function">useSpeak</span><span class="token punctuation">(</span>Animal<span class="token operator">&amp;</span> _animal<span class="token punctuation">)</span><span class="token punctuation">{</span>
    <span class="token comment">// 函数地址不确定</span>
    <span class="token comment">// 父类指针或引用指向子类对象</span>
    _animal<span class="token punctuation">.</span><span class="token function">speak</span><span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token punctuation">}</span>
<span class="token keyword keyword-int">int</span> <span class="token function">main</span><span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">{</span>
    Animal ani<span class="token punctuation">;</span>
    Dog dog<span class="token punctuation">;</span>
    Cat cat<span class="token punctuation">;</span>
    <span class="token function">useSpeak</span><span class="token punctuation">(</span>ani<span class="token punctuation">)</span><span class="token punctuation">;</span>
    <span class="token function">useSpeak</span><span class="token punctuation">(</span>cat<span class="token punctuation">)</span><span class="token punctuation">;</span>
    <span class="token function">useSpeak</span><span class="token punctuation">(</span>dog<span class="token punctuation">)</span><span class="token punctuation">;</span>
    <span class="token keyword keyword-return">return</span> <span class="token number">0</span><span class="token punctuation">;</span>
<span class="token punctuation">}</span>
</code></pre><h2 id="多态的原理-font-size3back类和对象-font-size3backcppnotesfontfont" ebook-toc-level-2="" heading="多态的原理 <font size=&quot;3&quot;><a href=&quot;#%E7%B1%BB%E5%92%8C%E5%AF%B9%E8%B1%A1-font-size3backcppnotesfont&quot;>back</a></font> ">多态的原理 <font size="3"><a href="#%E7%B1%BB%E5%92%8C%E5%AF%B9%E8%B1%A1-font-size3backcppnotesfont">back</a></font> </h2>
<p>对于父类<code>Animal</code>，其在MSVC编译器中的内存结构如下：</p>
<pre data-role="codeBlock" data-info="" class="language-text text"><code>class Animal    size(4):
        +---
 0      | {vfptr}
        +---

Animal::$vftable@:
        | &amp;Animal_meta
        |  0
 0      | &amp;Animal::speak

Animal::speak this adjustor: 0
</code></pre><p>对于子类<code>Cat</code>，其在MSVC编译器中的内存结构如下：</p>
<pre data-role="codeBlock" data-info="" class="language-text text"><code>class Cat       size(4):
        +---
 0      | +--- (base class Animal)
 0      | | {vfptr}
        | +---
        +---

Cat::$vftable@:
        | &amp;Cat_meta
        |  0
 0      | &amp;Cat::speak

Cat::speak this adjustor: 0
</code></pre><ul>
<li><em>"this adjustor" 代表指针调整器（pointer adjustor）。它是用于解决类继承中多重继承带来的偏移量问题的一种机制。<br>
在多重继承的情况下，派生类对象内部可能包含多个基类子对象，每个子对象都有自己的虚函数表和成员变量。由于基类子对象的内存布局可能与派生类对象不同（由于虚函数表和其他成员的存在），在调用基类的虚函数时，需要正确地调整this指针，使其指向正确的基类子对象。<br>
"this adjustor" 的值表示需要对this指针进行调整的偏移量。这个偏移量是根据派生类对象和基类子对象之间的内存布局计算得出的。通过应用这个偏移量来调整this指针，可以确保在调用基类的虚函数时，正确地访问基类子对象的成员和虚函数表。</em></li>
</ul>
<p><strong>具体实现</strong><br>
在C++中，虚函数表（vftable）是用来支持动态多态的机制。<strong>每个类</strong>（不是每个对象）都有一个独立的虚函数表。虚函数表是一个由指针组成的数组，存储了该类定义的虚函数的地址。<br>
当一个类中声明了虚函数时，编译器会在该类的虚函数表中为每个虚函数分配一个指针，并将其指向该类中实际定义的虚函数。<br>
<strong>每个对象</strong>在内存中存储了一个指向其所属类的虚函数表的指针。这个指针通常被称为虚函数表指针（vfptr）。虚函数表指针是对象的一部分，它指向该对象所属类的虚函数表。<br>
由于每个类都有自己的虚函数表，因此不同类的虚函数表是不同的。当通过指针或引用调用虚函数时，实际调用的是对象所属类的虚函数表中对应虚函数的地址。<br>
